pressure-test/results/sysbench/insert-20260504T071318Z.txt
sysbench 1.0.17 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 324.34 qps: 324.34 (r/w/o: 0.00/324.34/0.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 374.21 qps: 374.21 (r/w/o: 0.00/374.21/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 393.19 qps: 393.19 (r/w/o: 0.00/393.19/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 342.81 qps: 342.81 (r/w/o: 0.00/342.81/0.00) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 367.79 qps: 367.79 (r/w/o: 0.00/367.79/0.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 352.80 qps: 352.80 (r/w/o: 0.00/352.80/0.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           10784
        other:                           0
        total:                           10784
    transactions:                        10784  (359.20 per sec.)
    queries:                             10784  (359.20 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0220s
    total number of events:              10784

Latency (ms):
         min:                                    7.23
         avg:                                   22.26
         max:                                  286.31
         95th percentile:                       36.24
         sum:                               240002.44

Threads fairness:
    events (avg/stddev):           1348.0000/13.70
    execution time (avg/stddev):   30.0003/0.01