pressure-test/results/sysbench/read_write-20260504T071318Z.txt
sysbench 1.0.17 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 79.58 qps: 1616.56 (r/w/o: 1134.29/321.51/160.76) lat (ms,95%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 93.80 qps: 1865.89 (r/w/o: 1305.47/373.42/187.01) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 112.20 qps: 2255.40 (r/w/o: 1579.00/451.40/225.00) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 109.40 qps: 2174.04 (r/w/o: 1522.23/433.61/218.20) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 105.80 qps: 2124.39 (r/w/o: 1488.19/424.00/212.20) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 113.60 qps: 2274.31 (r/w/o: 1590.54/456.78/226.99) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            43120
        write:                           12320
        other:                           6160
        total:                           61600
    transactions:                        3080   (102.35 per sec.)
    queries:                             61600  (2047.04 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0910s
    total number of events:              3080

Latency (ms):
         min:                                   25.96
         avg:                                   78.02
         max:                                  734.57
         95th percentile:                      110.66
         sum:                               240291.38

Threads fairness:
    events (avg/stddev):           385.0000/14.64
    execution time (avg/stddev):   30.0364/0.03