pressure-test/results/sysbench/write_only-20260504T071318Z.txt
sysbench 1.0.17 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 234.94 qps: 1417.64 (r/w/o: 0.00/946.16/471.48) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 241.81 qps: 1450.46 (r/w/o: 0.00/966.84/483.62) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 242.20 qps: 1446.61 (r/w/o: 0.00/963.61/483.00) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 243.60 qps: 1461.38 (r/w/o: 0.00/974.19/487.19) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 229.61 qps: 1384.83 (r/w/o: 0.00/924.22/460.61) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 220.19 qps: 1318.95 (r/w/o: 0.00/878.76/440.18) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           28280
        other:                           14140
        total:                           42420
    transactions:                        7070   (235.51 per sec.)
    queries:                             42420  (1413.05 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0193s
    total number of events:              7070

Latency (ms):
         min:                                   11.45
         avg:                                   33.96
         max:                                  304.08
         95th percentile:                       51.94
         sum:                               240103.16

Threads fairness:
    events (avg/stddev):           883.7500/7.53
    execution time (avg/stddev):   30.0129/0.01